EDT/УТ/src/Catalogs/зпСхемыКатегорийЗаказов/зпСхемыКатегорийЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>зпСхемыКатегорийЗаказов</name>
  <attributes>
    <name>Регион</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗаказа</name>
    <type>
      <types>EnumRef.ТипыЗаказов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВидыПоказателейКатегорийЗаказов</name>
    <attributes>
      <name>ВидПоказателяКатегорийЗаказов</name>
      <type>
        <types>EnumRef.зпВидыПоказателейКатегорийЗаказов</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидПоказателяДоступен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

EDT/УТ/src/Enums/зпВидыПоказателейКатегорийЗаказов/зпВидыПоказателейКатегорийЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>зпВидыПоказателейКатегорийЗаказов</name>
  <enumValues>
    <name>ВесЗаказа</name>
  </enumValues>
  <enumValues>
    <name>ОбъемЗаказа</name>
  </enumValues>
  <enumValues>
    <name>ЗначениеРеквизитаЗаказа</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Catalogs/зпСхемыКатегорийЗаказов/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Для Каждого видПоказателя Из Перечисления.зпВидыПоказателейКатегорийЗаказов Цикл
			
			строкаТЧ = Объект.ВидыПоказателейКатегорийЗаказов.Добавить();
			строкаТЧ.ВидПоказателяКатегорийЗаказов = видПоказателя;
			
		КонецЦикла;
		
	Иначе	
		
		Элементы.ГрФорма.ТолькоПросмотр = Истина;

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Не ЗначениеЗаполнено(Объект.Наименование) Тогда
		Сообщить("Внимание!!! Ошибка записи, введите наименование!");
		Отказ = Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ТипЗаказа) Тогда
		Сообщить("Внимание!!! Ошибка записи, введите тип заказа!");
		Отказ = Истина;
	КонецЕсли;
	
	Для Каждого строкаТЧ Из Объект.ВидыПоказателейКатегорийЗаказов Цикл
		
		Если строкаТЧ.ВидПоказателяДоступен 
			И строкаТЧ.ВидПоказателяКатегорийЗаказов  = Перечисления.зпВидыПоказателейКатегорийЗаказов.ЗначениеРеквизитаЗаказа 
			И Не ЗначениеЗаполнено(строкаТЧ.ИмяРеквизита) Тогда
			Сообщить("Внимание!!! Ошибка записи, введите имя реквизита в табличной части!");
			Отказ = Истина;	
		КонецЕсли;	
		
	КонецЦикла;
	
КонецПроцедуры
